## beta Plan
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.aks[0] will be created
+   resource "azurerm_kubernetes_cluster" "aks" {
+       dns_prefix              = "dank8s"
+       fqdn                    = (known after apply)
+       id                      = (known after apply)
+       kube_admin_config       = (known after apply)
+       kube_admin_config_raw   = (sensitive value)
+       kube_config             = (known after apply)
+       kube_config_raw         = (sensitive value)
+       kubernetes_version      = "1.22.6"
+       location                = "eastus"
+       name                    = "aks-dank-beta"
+       node_resource_group     = "node_resources_beta"
+       private_cluster_enabled = true
+       private_dns_zone_id     = (known after apply)
+       private_fqdn            = (known after apply)
+       private_link_enabled    = (known after apply)
+       resource_group_name     = "primogenial_resources"
+       sku_tier                = "Free"
+       tags                    = {
+           "Environment" = "Test"
        }

+       addon_profile {
+           aci_connector_linux {
+               enabled     = (known after apply)
+               subnet_name = (known after apply)
            }

+           azure_policy {
+               enabled = (known after apply)
            }

+           http_application_routing {
+               enabled                            = (known after apply)
+               http_application_routing_zone_name = (known after apply)
            }

+           ingress_application_gateway {
+               effective_gateway_id                 = (known after apply)
+               enabled                              = (known after apply)
+               gateway_id                           = (known after apply)
+               gateway_name                         = (known after apply)
+               ingress_application_gateway_identity = (known after apply)
+               subnet_cidr                          = (known after apply)
+               subnet_id                            = (known after apply)
            }

+           kube_dashboard {
+               enabled = (known after apply)
            }

+           oms_agent {
+               enabled                    = (known after apply)
+               log_analytics_workspace_id = (known after apply)
+               oms_agent_identity         = (known after apply)
            }
        }

+       auto_scaler_profile {
+           balance_similar_node_groups      = (known after apply)
+           empty_bulk_delete_max            = (known after apply)
+           expander                         = (known after apply)
+           max_graceful_termination_sec     = (known after apply)
+           max_node_provisioning_time       = (known after apply)
+           max_unready_nodes                = (known after apply)
+           max_unready_percentage           = (known after apply)
+           new_pod_scale_up_delay           = (known after apply)
+           scale_down_delay_after_add       = (known after apply)
+           scale_down_delay_after_delete    = (known after apply)
+           scale_down_delay_after_failure   = (known after apply)
+           scale_down_unneeded              = (known after apply)
+           scale_down_unready               = (known after apply)
+           scale_down_utilization_threshold = (known after apply)
+           scan_interval                    = (known after apply)
+           skip_nodes_with_local_storage    = (known after apply)
+           skip_nodes_with_system_pods      = (known after apply)
        }

+       default_node_pool {
+           enable_auto_scaling          = false
+           kubelet_disk_type            = (known after apply)
+           max_count                    = 2
+           max_pods                     = 30
+           min_count                    = 1
+           name                         = "system"
+           node_count                   = 1
+           only_critical_addons_enabled = true
+           orchestrator_version         = "1.22.6"
+           os_disk_size_gb              = (known after apply)
+           os_disk_type                 = "Managed"
+           type                         = "VirtualMachineScaleSets"
+           vm_size                      = "Standard_DS2_v2"
        }

+       identity {
+           principal_id = (known after apply)
+           tenant_id    = (known after apply)
+           type         = "SystemAssigned"
        }

+       kubelet_identity {
+           client_id                 = (known after apply)
+           object_id                 = (known after apply)
+           user_assigned_identity_id = (known after apply)
        }

+       linux_profile {
+           admin_username = "robodank"

+           ssh_key {
+               key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDeu597VZodBbrfxSQA4SFFeALfCJDnSV2G2eZ2rPjvpukao9Wsu1ChpI3hiMLtRTBzdeNlL41K16rgDmmv7QLQlsZfUFeDL4OWMrBsUEuJo+BtjCgU3NHxUHTOphoYrg/yaqD935UMoyCOMmC/Z7N54XlVidKrANWQJRC9rmxB2auWGHdI0YzMCgTDFD7M57nKyvl025HK6FHZ2l9IuVwWaCrv7Pkncs6/d43z8sII1om/oQ6d4yFDrG4thWX0w4pITVSsSZwzUeiqsmSzEiBaQ1EWNKW/4kVZ8lWRRroJQvQk2BEcePAp3SOQShhPRmVqtOgTO4+UVcGSO7fjFXDD daniel@hydra"
            }
        }

+       network_profile {
+           dns_service_ip     = (known after apply)
+           docker_bridge_cidr = (known after apply)
+           load_balancer_sku  = (known after apply)
+           network_mode       = (known after apply)
+           network_plugin     = (known after apply)
+           network_policy     = (known after apply)
+           outbound_type      = (known after apply)
+           pod_cidr           = (known after apply)
+           service_cidr       = (known after apply)

+           load_balancer_profile {
+               effective_outbound_ips    = (known after apply)
+               idle_timeout_in_minutes   = (known after apply)
+               managed_outbound_ip_count = (known after apply)
+               outbound_ip_address_ids   = (known after apply)
+               outbound_ip_prefix_ids    = (known after apply)
+               outbound_ports_allocated  = (known after apply)
            }
        }

+       role_based_access_control {
+           enabled = (known after apply)

+           azure_active_directory {
+               admin_group_object_ids = (known after apply)
+               azure_rbac_enabled     = (known after apply)
+               client_app_id          = (known after apply)
+               managed                = (known after apply)
+               server_app_id          = (known after apply)
+               server_app_secret      = (sensitive value)
+               tenant_id              = (known after apply)
            }
        }

+       windows_profile {
+           admin_password = (sensitive value)
+           admin_username = (known after apply)
+           license        = (known after apply)
        }
    }

  # azurerm_kubernetes_cluster_node_pool.app[0] will be created
+   resource "azurerm_kubernetes_cluster_node_pool" "app" {
+       id                    = (known after apply)
+       kubelet_disk_type     = (known after apply)
+       kubernetes_cluster_id = (known after apply)
+       max_count             = 3
+       max_pods              = 30
+       min_count             = 1
+       mode                  = "User"
+       name                  = "app"
+       node_count            = 1
+       orchestrator_version  = "1.22.6"
+       os_disk_size_gb       = (known after apply)
+       os_disk_type          = "Managed"
+       os_type               = "Linux"
+       priority              = "Regular"
+       spot_max_price        = -1
+       tags                  = {
+           "Environment" = "Test"
        }
+       vm_size               = "Standard_DS2_v2"
    }

  # azurerm_resource_group.rg[0] will be created
+   resource "azurerm_resource_group" "rg" {
+       id       = (known after apply)
+       location = "eastus"
+       name     = "primogenial_resources"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```